In [46]:
import pandas as pd 
import numpy as np

In [47]:
obj4 = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['ohio','texas','california'])
print(obj4)
obj5 = obj4.reindex(['a','b','c','d'])
print(obj5)

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8
   ohio  texas  california
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [48]:
obj6 = obj5.reindex(columns=['texas','california','utah','ohio'])
print(obj6)

   texas  california  utah  ohio
a    1.0         2.0   NaN   0.0
b    4.0         5.0   NaN   3.0
c    7.0         8.0   NaN   6.0
d    NaN         NaN   NaN   NaN

In [49]:
obj6 = obj5.reindex(columns=['texas','california','utah','ohio'],fill_value=1)
print(obj6)

   texas  california  utah  ohio
a    1.0         2.0     1   0.0
b    4.0         5.0     1   3.0
c    7.0         8.0     1   6.0
d    NaN         NaN     1   NaN

In [65]:
obj6 = obj5.reindex(columns=['texas','california','utah','ohio'],fill_value=1)
print(obj6)

obj8 = obj5.drop('ohio',axis=1)
print(obj8)

obj9 = obj5.drop(columns=['ohio'])
print(obj9)

   texas  california  utah  ohio
a    1.0         2.0     1   0.0
b    4.0         5.0     1   3.0
c    7.0         8.0     1   6.0
d    NaN         NaN     1   NaN
   texas  california
a    1.0         2.0
b    4.0         5.0
c    7.0         8.0
d    NaN         NaN
   texas  california
a    1.0         2.0
b    4.0         5.0
c    7.0         8.0
d    NaN         NaN

In [52]:
s2 = pd.Series([0,1,2],index=[10,20,30])
print(s2)

10    0
20    1
30    2
dtype: int64

In [53]:
s3 = s2.reindex([11,21,34])
print(s3)

11   NaN
21   NaN
34   NaN
dtype: float64

In [56]:
s4 = s2.reindex([11,21,34],method='nearest',tolerance=2)
print(s4)

11    0.0
21    1.0
34    NaN
dtype: float64

In [59]:
index = pd.MultiIndex.from_product([['A','B'],[1,2]])
print(index)

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           )

In [60]:
multindex = pd.MultiIndex.from_product([['A','B','C'],[1,2]])
print(multindex)

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2),
            ('C', 1),
            ('C', 2)],
           )

In [61]:
s = pd.Series([10,20,30,40],index=index)
print(s)

A  1    10
   2    20
B  1    30
   2    40
dtype: int64

In [62]:
new_s = s.reindex(index=multindex)
print(new_s)

A  1    10.0
   2    20.0
B  1    30.0
   2    40.0
C  1     NaN
   2     NaN
dtype: float64

In [75]:
s3 = pd.Series(np.arange(4),index=['a','b','c','d'])
print(s3)

a    0
b    1
c    2
d    3
dtype: int64

In [76]:
s3['b']

np.int64(1)

In [78]:
s3.iloc[1]

np.int64(1)

In [80]:
print(s3[['b','a','c']])

b    1
a    0
c    2
dtype: int64

In [81]:
print(s3.iloc[[1,0,2]])

b    1
a    0
c    2
dtype: int64

In [83]:
print(s3[s3<2])

a    0
b    1
dtype: int64

In [84]:
s3[1:3]

b    1
c    2
dtype: int64

In [86]:
s3['b':'c']

b    1
c    2
dtype: int64

In [91]:
obj6[:2]

   texas  california  utah  ohio
a    1.0         2.0     1   0.0
b    4.0         5.0     1   3.0

In [94]:
obj6[obj6>3]

   texas  california  utah  ohio
a    NaN         NaN   NaN   NaN
b    4.0         5.0   NaN   NaN
c    7.0         8.0   NaN   6.0
d    NaN         NaN   NaN   NaN

In [96]:
obj6>3

   texas  california   utah   ohio
a  False       False  False  False
b   True        True  False  False
c   True        True  False   True
d  False       False  False  False

In [110]:
obj6.iloc[1,[1,2]]

california    5.0
utah          1.0
Name: b, dtype: float64

In [ ]:
obj4[obj4.iloc[:, 1] > 1].iloc[:, [0,1]]

   ohio  texas
b     3      4
c     6      7